
class ExtendedReportColumnLists:
    LIST_OF_VALID_COLNAMES: list[str] = [
        "Код",
        "Товар",
        "КодПроизводителя",
        "Кол-во",
        "Себестоимость без НДС",
        "Ост. Сумма без НДС",
        "Ост. пути",
        "Ост. кол-во",
        "Продажа без НДС"
    ]

    TMP_COLNAMES: list[str] = [
        "Артикул",
        "Наименование",
        "Код модели",
        "Магазин",
        "Код магазина",
        "metric",
        "value"
    ]

    FINAL_COLNAMES: list[str] = [
        "Код модели",
        "Наименование",
        "Артикул",
        "Магазин",
        "Код магазина",
        "Продажи, шт",
        "Остатки, шт",
        "Остатки в пути",
        "Себестоимость без НДС",
        "Ост. Сумма без НДС",
        "Продажа без НДС"
    ]